Tutorials/Case19/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.1                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

  lx1 0;
  lx2 0.2;
  ly1 0;
  ly2 0.048;
  ly3 0.052;
  ly4 0.1;
  lz1 0;
  lz2 0.01;

vertices
(    
     ($lx1 $ly1 $lz1)
     ($lx2 $ly1 $lz1)
     ($lx2 $ly2 $lz1)
     ($lx2 $ly3 $lz1)
     ($lx2 $ly4 $lz1)
     ($lx1 $ly4 $lz1)
     ($lx1 $ly3 $lz1)
     ($lx1 $ly2 $lz1)
     ($lx1 $ly1 $lz2)
     ($lx2 $ly1 $lz2)
     ($lx2 $ly2 $lz2)
     ($lx2 $ly3 $lz2)
     ($lx2 $ly4 $lz2)
     ($lx1 $ly4 $lz2)
     ($lx1 $ly3 $lz2)
     ($lx1 $ly2 $lz2)
     
);
    
blocks
     (
     hex (0 1 2 7 8 9 10 15) (600 144 1) simpleGrading (1 1 1)
     hex (7 2 3 6 15 10 11 14) (600 12 1) simpleGrading (1 1 1)
     hex (6 3 4 5 14 11 12 13) (600 144 1) simpleGrading (1 1 1)
     );   
boundary
(
    frontAndBack
    {
        type empty;
        faces
        (
            (0 1 2 7)
            (7 2 3 6)
            (6 3 4 5)
            (8 9 10 15)
            (15 10 11 14)
            (14 11 12 13)
        );
    }
    inlet
    {
        type patch;
        faces
        (
            (0 8 15 7)
            (7 15 14 6)
            (6 14 13 5)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (1 2 10 9)
            (2 3 11 10)
            (3 4 12 11)
        );
    }
    topandbottom
    {
        type patch;
        faces
        (
            (4 5 13 12)
            (0 1 9 8)
        );
    }
);
// ************************************************************************* //
